espressif/esp-idf/components/soc/esp32s31/register/soc/jpeg_reg.h
/** JPEG_C1_REG register
 *  Control and configuration registers
 */
#define JPEG_C1_REG (DR_REG_JPEG_BASE + 0x28)
/** JPEG_C1_DQT_TBL_SEL : R/W; bitpos: [7:0]; default: 0;
 *  choose  c1 quntization table id (TBD)
 */
#define JPEG_C1_DQT_TBL_SEL    0x000000FFU
#define JPEG_C1_DQT_TBL_SEL_M  (JPEG_C1_DQT_TBL_SEL_V << JPEG_C1_DQT_TBL_SEL_S)
#define JPEG_C1_DQT_TBL_SEL_V  0x000000FFU
#define JPEG_C1_DQT_TBL_SEL_S  0
/** JPEG_C1_Y_FACTOR : R/W; bitpos: [11:8]; default: 1;
 *  vertical sampling factor of c1
 */
#define JPEG_C1_Y_FACTOR    0x0000000FU
#define JPEG_C1_Y_FACTOR_M  (JPEG_C1_Y_FACTOR_V << JPEG_C1_Y_FACTOR_S)
#define JPEG_C1_Y_FACTOR_V  0x0000000FU
#define JPEG_C1_Y_FACTOR_S  8
/** JPEG_C1_X_FACTOR : R/W; bitpos: [15:12]; default: 1;
 *  horizontal sampling factor of c1
 */
#define JPEG_C1_X_FACTOR    0x0000000FU
#define JPEG_C1_X_FACTOR_M  (JPEG_C1_X_FACTOR_V << JPEG_C1_X_FACTOR_S)
#define JPEG_C1_X_FACTOR_V  0x0000000FU
#define JPEG_C1_X_FACTOR_S  12
/** JPEG_C1_ID : R/W; bitpos: [23:16]; default: 0;
 *  the identifier of c1
 */
#define JPEG_C1_ID    0x000000FFU
#define JPEG_C1_ID_M  (JPEG_C1_ID_V << JPEG_C1_ID_S)
#define JPEG_C1_ID_V  0x000000FFU
#define JPEG_C1_ID_S  16

/** JPEG_C2_REG register
 *  Control and configuration registers
 */
#define JPEG_C2_REG (DR_REG_JPEG_BASE + 0x2c)
/** JPEG_C2_DQT_TBL_SEL : R/W; bitpos: [7:0]; default: 0;
 *  choose  c2 quntization table id (TBD)
 */
#define JPEG_C2_DQT_TBL_SEL    0x000000FFU
#define JPEG_C2_DQT_TBL_SEL_M  (JPEG_C2_DQT_TBL_SEL_V << JPEG_C2_DQT_TBL_SEL_S)
#define JPEG_C2_DQT_TBL_SEL_V  0x000000FFU
#define JPEG_C2_DQT_TBL_SEL_S  0
/** JPEG_C2_Y_FACTOR : R/W; bitpos: [11:8]; default: 1;
 *  vertical sampling factor of c2
 */
#define JPEG_C2_Y_FACTOR    0x0000000FU
#define JPEG_C2_Y_FACTOR_M  (JPEG_C2_Y_FACTOR_V << JPEG_C2_Y_FACTOR_S)
#define JPEG_C2_Y_FACTOR_V  0x0000000FU
#define JPEG_C2_Y_FACTOR_S  8
/** JPEG_C2_X_FACTOR : R/W; bitpos: [15:12]; default: 1;
 *  horizontal sampling factor of c2
 */
#define JPEG_C2_X_FACTOR    0x0000000FU
#define JPEG_C2_X_FACTOR_M  (JPEG_C2_X_FACTOR_V << JPEG_C2_X_FACTOR_S)
#define JPEG_C2_X_FACTOR_V  0x0000000FU
#define JPEG_C2_X_FACTOR_S  12
/** JPEG_C2_ID : R/W; bitpos: [23:16]; default: 0;
 *  the identifier of c2
 */
#define JPEG_C2_ID    0x000000FFU
#define JPEG_C2_ID_M  (JPEG_C2_ID_V << JPEG_C2_ID_S)
#define JPEG_C2_ID_V  0x000000FFU
#define JPEG_C2_ID_S  16

/** JPEG_C3_REG register
 *  Control and configuration registers
 */
#define JPEG_C3_REG (DR_REG_JPEG_BASE + 0x30)
/** JPEG_C3_DQT_TBL_SEL : R/W; bitpos: [7:0]; default: 0;
 *  choose  c3 quntization table id (TBD)
 */
#define JPEG_C3_DQT_TBL_SEL    0x000000FFU
#define JPEG_C3_DQT_TBL_SEL_M  (JPEG_C3_DQT_TBL_SEL_V << JPEG_C3_DQT_TBL_SEL_S)
#define JPEG_C3_DQT_TBL_SEL_V  0x000000FFU
#define JPEG_C3_DQT_TBL_SEL_S  0
/** JPEG_C3_Y_FACTOR : R/W; bitpos: [11:8]; default: 1;
 *  vertical sampling factor of c3
 */
#define JPEG_C3_Y_FACTOR    0x0000000FU
#define JPEG_C3_Y_FACTOR_M  (JPEG_C3_Y_FACTOR_V << JPEG_C3_Y_FACTOR_S)
#define JPEG_C3_Y_FACTOR_V  0x0000000FU
#define JPEG_C3_Y_FACTOR_S  8
/** JPEG_C3_X_FACTOR : R/W; bitpos: [15:12]; default: 1;
 *  horizontal sampling factor of c3
 */
#define JPEG_C3_X_FACTOR    0x0000000FU
#define JPEG_C3_X_FACTOR_M  (JPEG_C3_X_FACTOR_V << JPEG_C3_X_FACTOR_S)
#define JPEG_C3_X_FACTOR_V  0x0000000FU
#define JPEG_C3_X_FACTOR_S  12
/** JPEG_C3_ID : R/W; bitpos: [23:16]; default: 0;
 *  the identifier of c3
 */
#define JPEG_C3_ID    0x000000FFU
#define JPEG_C3_ID_M  (JPEG_C3_ID_V << JPEG_C3_ID_S)
#define JPEG_C3_ID_V  0x000000FFU
#define JPEG_C3_ID_S  16

/** JPEG_DHT_INFO_REG register
 *  Control and configuration registers
 */
#define JPEG_DHT_INFO_REG (DR_REG_JPEG_BASE + 0x34)
/** JPEG_DC0_DHT_ID : R/W; bitpos: [3:0]; default: 0;
 *  configure dht dc table 0 id
 */
#define JPEG_DC0_DHT_ID    0x0000000FU
#define JPEG_DC0_DHT_ID_M  (JPEG_DC0_DHT_ID_V << JPEG_DC0_DHT_ID_S)
#define JPEG_DC0_DHT_ID_V  0x0000000FU
#define JPEG_DC0_DHT_ID_S  0
/** JPEG_DC1_DHT_ID : R/W; bitpos: [7:4]; default: 1;
 *  configure dht dc table 1 id
 */
#define JPEG_DC1_DHT_ID    0x0000000FU
#define JPEG_DC1_DHT_ID_M  (JPEG_DC1_DHT_ID_V << JPEG_DC1_DHT_ID_S)
#define JPEG_DC1_DHT_ID_V  0x0000000FU
#define JPEG_DC1_DHT_ID_S  4
/** JPEG_AC0_DHT_ID : R/W; bitpos: [11:8]; default: 0;
 *  configure dht ac table 0 id
 */
#define JPEG_AC0_DHT_ID    0x0000000FU
#define JPEG_AC0_DHT_ID_M  (JPEG_AC0_DHT_ID_V << JPEG_AC0_DHT_ID_S)
#define JPEG_AC0_DHT_ID_V  0x0000000FU
#define JPEG_AC0_DHT_ID_S  8
/** JPEG_AC1_DHT_ID : R/W; bitpos: [15:12]; default: 1;
 *  configure dht ac table 1 id
 */
#define JPEG_AC1_DHT_ID    0x0000000FU
#define JPEG_AC1_DHT_ID_M  (JPEG_AC1_DHT_ID_V << JPEG_AC1_DHT_ID_S)
#define JPEG_AC1_DHT_ID_V  0x0000000FU
#define JPEG_AC1_DHT_ID_S  12

/** JPEG_INT_RAW_REG register
 *  Interrupt raw registers
 */
#define JPEG_INT_RAW_REG (DR_REG_JPEG_BASE + 0x38)
/** JPEG_DONE_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  This raw interrupt bit turns to high level when JPEG finishes encoding a picture..
 */
#define JPEG_DONE_INT_RAW    (BIT(0))
#define JPEG_DONE_INT_RAW_M  (JPEG_DONE_INT_RAW_V << JPEG_DONE_INT_RAW_S)
#define JPEG_DONE_INT_RAW_V  0x00000001U
#define JPEG_DONE_INT_RAW_S  0
/** JPEG_RLE_PARALLEL_ERR_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit to sign that rle parallel error when decoding.
 */
#define JPEG_RLE_PARALLEL_ERR_INT_RAW    (BIT(1))
#define JPEG_RLE_PARALLEL_ERR_INT_RAW_M  (JPEG_RLE_PARALLEL_ERR_INT_RAW_V << JPEG_RLE_PARALLEL_ERR_INT_RAW_S)
#define JPEG_RLE_PARALLEL_ERR_INT_RAW_V  0x00000001U
#define JPEG_RLE_PARALLEL_ERR_INT_RAW_S  1
/** JPEG_CID_ERR_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit to sign that scan id check with component fails when decoding.
 */
#define JPEG_CID_ERR_INT_RAW    (BIT(2))
#define JPEG_CID_ERR_INT_RAW_M  (JPEG_CID_ERR_INT_RAW_V << JPEG_CID_ERR_INT_RAW_S)
#define JPEG_CID_ERR_INT_RAW_V  0x00000001U
#define JPEG_CID_ERR_INT_RAW_S  2
/** JPEG_C_DHT_DC_ID_ERR_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit to sign that scan component's dc dht id check with dc dht
 *  table's id fails when decoding.
 */
#define JPEG_C_DHT_DC_ID_ERR_INT_RAW    (BIT(3))
#define JPEG_C_DHT_DC_ID_ERR_INT_RAW_M  (JPEG_C_DHT_DC_ID_ERR_INT_RAW_V << JPEG_C_DHT_DC_ID_ERR_INT_RAW_S)
#define JPEG_C_DHT_DC_ID_ERR_INT_RAW_V  0x00000001U
#define JPEG_C_DHT_DC_ID_ERR_INT_RAW_S  3
/** JPEG_C_DHT_AC_ID_ERR_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit to sign that scan component's ac dht id check with ac dht
 *  table's id fails when decoding.
 */
#define JPEG_C_DHT_AC_ID_ERR_INT_RAW    (BIT(4))
#define JPEG_C_DHT_AC_ID_ERR_INT_RAW_M  (JPEG_C_DHT_AC_ID_ERR_INT_RAW_V << JPEG_C_DHT_AC_ID_ERR_INT_RAW_S)
#define JPEG_C_DHT_AC_ID_ERR_INT_RAW_V  0x00000001U
#define JPEG_C_DHT_AC_ID_ERR_INT_RAW_S  4
/** JPEG_C_DQT_ID_ERR_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit to sign that scan component's dqt id check with dqt table's
 *  id fails when decoding.
 */
#define JPEG_C_DQT_ID_ERR_INT_RAW    (BIT(5))
#define JPEG_C_DQT_ID_ERR_INT_RAW_M  (JPEG_C_DQT_ID_ERR_INT_RAW_V << JPEG_C_DQT_ID_ERR_INT_RAW_S)
#define JPEG_C_DQT_ID_ERR_INT_RAW_V  0x00000001U
#define JPEG_C_DQT_ID_ERR_INT_RAW_S  5
/** JPEG_RST_UXP_ERR_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit to sign that RST header marker is detected but restart
 *  interval is 0 when decoding.
 */
#define JPEG_RST_UXP_ERR_INT_RAW    (BIT(6))
#define JPEG_RST_UXP_ERR_INT_RAW_M  (JPEG_RST_UXP_ERR_INT_RAW_V << JPEG_RST_UXP_ERR_INT_RAW_S)
#define JPEG_RST_UXP_ERR_INT_RAW_V  0x00000001U
#define JPEG_RST_UXP_ERR_INT_RAW_S  6
/** JPEG_RST_CHECK_NONE_ERR_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit to sign that RST header marker is not detected but restart
 *  interval is not 0 when decoding.
 */
#define JPEG_RST_CHECK_NONE_ERR_INT_RAW    (BIT(7))
#define JPEG_RST_CHECK_NONE_ERR_INT_RAW_M  (JPEG_RST_CHECK_NONE_ERR_INT_RAW_V << JPEG_RST_CHECK_NONE_ERR_INT_RAW_S)
#define JPEG_RST_CHECK_NONE_ERR_INT_RAW_V  0x00000001U
#define JPEG_RST_CHECK_NONE_ERR_INT_RAW_S  7
/** JPEG_RST_CHECK_POS_ERR_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit to sign that RST header marker position mismatches with
 *  restart interval when decoding.
 */
#define JPEG_RST_CHECK_POS_ERR_INT_RAW    (BIT(8))
#define JPEG_RST_CHECK_POS_ERR_INT_RAW_M  (JPEG_RST_CHECK_POS_ERR_INT_RAW_V << JPEG_RST_CHECK_POS_ERR_INT_RAW_S)
#define JPEG_RST_CHECK_POS_ERR_INT_RAW_V  0x00000001U
#define JPEG_RST_CHECK_POS_ERR_INT_RAW_S  8
/** JPEG_OUT_EOF_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when the last pixel of one square has
 *  been transmitted for Tx channel.
 */
#define JPEG_OUT_EOF_INT_RAW    (BIT(9))
#define JPEG_OUT_EOF_INT_RAW_M  (JPEG_OUT_EOF_INT_RAW_V << JPEG_OUT_EOF_INT_RAW_S)
#define JPEG_OUT_EOF_INT_RAW_V  0x00000001U
#define JPEG_OUT_EOF_INT_RAW_S  9
/** JPEG_SR_COLOR_MODE_ERR_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit to sign that the selected source color mode is not supported.
 */
#define JPEG_SR_COLOR_MODE_ERR_INT_RAW    (BIT(10))
#define JPEG_SR_COLOR_MODE_ERR_INT_RAW_M  (JPEG_SR_COLOR_MODE_ERR_INT_RAW_V << JPEG_SR_COLOR_MODE_ERR_INT_RAW_S)
#define JPEG_SR_COLOR_MODE_ERR_INT_RAW_V  0x00000001U
#define JPEG_SR_COLOR_MODE_ERR_INT_RAW_S  10
/** JPEG_DCT_DONE_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit to sign that one dct calculation is finished.
 */
#define JPEG_DCT_DONE_INT_RAW    (BIT(11))
#define JPEG_DCT_DONE_INT_RAW_M  (JPEG_DCT_DONE_INT_RAW_V << JPEG_DCT_DONE_INT_RAW_S)
#define JPEG_DCT_DONE_INT_RAW_V  0x00000001U
#define JPEG_DCT_DONE_INT_RAW_S  11
/** JPEG_BS_LAST_BLOCK_EOF_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit to sign that the coding process for last block is finished.
 */
#define JPEG_BS_LAST_BLOCK_EOF_INT_RAW    (BIT(12))
#define JPEG_BS_LAST_BLOCK_EOF_INT_RAW_M  (JPEG_BS_LAST_BLOCK_EOF_INT_RAW_V << JPEG_BS_LAST_BLOCK_EOF_INT_RAW_S)
#define JPEG_BS_LAST_BLOCK_EOF_INT_RAW_V  0x00000001U
#define JPEG_BS_LAST_BLOCK_EOF_INT_RAW_S  12
/** JPEG_SCAN_CHECK_NONE_ERR_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw interrupt bit to sign that SOS header marker is not detected but there are
 *  still components left to be decoded.
 */
#define JPEG_SCAN_CHECK_NONE_ERR_INT_RAW    (BIT(13))
#define JPEG_SCAN_CHECK_NONE_ERR_INT_RAW_M  (JPEG_SCAN_CHECK_NONE_ERR_INT_RAW_V << JPEG_SCAN_CHECK_NONE_ERR_INT_RAW_S)
#define JPEG_SCAN_CHECK_NONE_ERR_INT_RAW_V  0x00000001U
#define JPEG_SCAN_CHECK_NONE_ERR_INT_RAW_S  13
/** JPEG_SCAN_CHECK_POS_ERR_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The raw interrupt bit to sign that SOS header marker position wrong when decoding.
 */
#define JPEG_SCAN_CHECK_POS_ERR_INT_RAW    (BIT(14))
#define JPEG_SCAN_CHECK_POS_ERR_INT_RAW_M  (JPEG_SCAN_CHECK_POS_ERR_INT_RAW_V << JPEG_SCAN_CHECK_POS_ERR_INT_RAW_S)
#define JPEG_SCAN_CHECK_POS_ERR_INT_RAW_V  0x00000001U
#define JPEG_SCAN_CHECK_POS_ERR_INT_RAW_S  14
/** JPEG_UXP_DET_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The raw interrupt bit to sign that unsupported header marker is detected when
 *  decoding.
 */
#define JPEG_UXP_DET_INT_RAW    (BIT(15))
#define JPEG_UXP_DET_INT_RAW_M  (JPEG_UXP_DET_INT_RAW_V << JPEG_UXP_DET_INT_RAW_S)
#define JPEG_UXP_DET_INT_RAW_V  0x00000001U
#define JPEG_UXP_DET_INT_RAW_S  15
/** JPEG_EN_FRAME_EOF_ERR_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  The raw interrupt bit to sign that received pixel blocks are smaller than expected
 *  when encoding.
 */
#define JPEG_EN_FRAME_EOF_ERR_INT_RAW    (BIT(16))
#define JPEG_EN_FRAME_EOF_ERR_INT_RAW_M  (JPEG_EN_FRAME_EOF_ERR_INT_RAW_V << JPEG_EN_FRAME_EOF_ERR_INT_RAW_S)
#define JPEG_EN_FRAME_EOF_ERR_INT_RAW_V  0x00000001U
#define JPEG_EN_FRAME_EOF_ERR_INT_RAW_S  16
/** JPEG_EN_FRAME_EOF_LACK_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  The raw interrupt bit to sign that the frame eof sign bit from dma input is missing
 *  when encoding. But the number of pixel blocks is enough.
 */
#define JPEG_EN_FRAME_EOF_LACK_INT_RAW    (BIT(17))
#define JPEG_EN_FRAME_EOF_LACK_INT_RAW_M  (JPEG_EN_FRAME_EOF_LACK_INT_RAW_V << JPEG_EN_FRAME_EOF_LACK_INT_RAW_S)
#define JPEG_EN_FRAME_EOF_LACK_INT_RAW_V  0x00000001U
#define JPEG_EN_FRAME_EOF_LACK_INT_RAW_S  17
/** JPEG_DE_FRAME_EOF_ERR_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  The raw interrupt bit to sign that decoded blocks are smaller than expected when
 *  decoding.
 */
#define JPEG_DE_FRAME_EOF_ERR_INT_RAW    (BIT(18))
#define JPEG_DE_FRAME_EOF_ERR_INT_RAW_M  (JPEG_DE_FRAME_EOF_ERR_INT_RAW_V << JPEG_DE_FRAME_EOF_ERR_INT_RAW_S)
#define JPEG_DE_FRAME_EOF_ERR_INT_RAW_V  0x00000001U
#define JPEG_DE_FRAME_EOF_ERR_INT_RAW_S  18
/** JPEG_DE_FRAME_EOF_LACK_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  The raw interrupt bit to sign that the either frame eof from dma input or eoi
 *  marker is missing when encoding. But the number of decoded blocks is enough.
 */
#define JPEG_DE_FRAME_EOF_LACK_INT_RAW    (BIT(19))
#define JPEG_DE_FRAME_EOF_LACK_INT_RAW_M  (JPEG_DE_FRAME_EOF_LACK_INT_RAW_V << JPEG_DE_FRAME_EOF_LACK_INT_RAW_S)
#define JPEG_DE_FRAME_EOF_LACK_INT_RAW_V  0x00000001U
#define JPEG_DE_FRAME_EOF_LACK_INT_RAW_S  19
/** JPEG_SOS_UNMATCH_ERR_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  The raw interrupt bit to sign that the component number of a scan is 0 or does not
 *  match the sos marker's length when decoding.
 */
#define JPEG_SOS_UNMATCH_ERR_INT_RAW    (BIT(20))
#define JPEG_SOS_UNMATCH_ERR_INT_RAW_M  (JPEG_SOS_UNMATCH_ERR_INT_RAW_V << JPEG_SOS_UNMATCH_ERR_INT_RAW_S)
#define JPEG_SOS_UNMATCH_ERR_INT_RAW_V  0x00000001U
#define JPEG_SOS_UNMATCH_ERR_INT_RAW_S  20
/** JPEG_MARKER_ERR_FST_SCAN_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  The raw interrupt bit to sign that the first scan has header marker error when
 *  decoding.
 */
#define JPEG_MARKER_ERR_FST_SCAN_INT_RAW    (BIT(21))
#define JPEG_MARKER_ERR_FST_SCAN_INT_RAW_M  (JPEG_MARKER_ERR_FST_SCAN_INT_RAW_V << JPEG_MARKER_ERR_FST_SCAN_INT_RAW_S)
#define JPEG_MARKER_ERR_FST_SCAN_INT_RAW_V  0x00000001U
#define JPEG_MARKER_ERR_FST_SCAN_INT_RAW_S  21
/** JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  The raw interrupt bit to sign that the following scans but not the first scan have
 *  header marker error when decoding.
 */
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW    (BIT(22))
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW_M  (JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW_V << JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW_S)
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW_V  0x00000001U
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_RAW_S  22
/** JPEG_UNDET_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  The raw interrupt bit to sign that JPEG format is not detected at the eof data of a
 *  packet when decoding.
 */
#define JPEG_UNDET_INT_RAW    (BIT(23))
#define JPEG_UNDET_INT_RAW_M  (JPEG_UNDET_INT_RAW_V << JPEG_UNDET_INT_RAW_S)
#define JPEG_UNDET_INT_RAW_V  0x00000001U
#define JPEG_UNDET_INT_RAW_S  23
/** JPEG_DECODE_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  The raw interrupt bit to sign that decode pause time is longer than the setting
 *  decode timeout time when decoding.
 */
#define JPEG_DECODE_TIMEOUT_INT_RAW    (BIT(24))
#define JPEG_DECODE_TIMEOUT_INT_RAW_M  (JPEG_DECODE_TIMEOUT_INT_RAW_V << JPEG_DECODE_TIMEOUT_INT_RAW_S)
#define JPEG_DECODE_TIMEOUT_INT_RAW_V  0x00000001U
#define JPEG_DECODE_TIMEOUT_INT_RAW_S  24
/** JPEG_ENCODE_TIMEOUT_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  The raw interrupt bit to sign that encode can not output bitstream time is longer
 *  than the setting encode timeout time when encoding.
 */
#define JPEG_ENCODE_TIMEOUT_INT_RAW    (BIT(25))
#define JPEG_ENCODE_TIMEOUT_INT_RAW_M  (JPEG_ENCODE_TIMEOUT_INT_RAW_V << JPEG_ENCODE_TIMEOUT_INT_RAW_S)
#define JPEG_ENCODE_TIMEOUT_INT_RAW_V  0x00000001U
#define JPEG_ENCODE_TIMEOUT_INT_RAW_S  25

