espressif/esp-idf/components/soc/esp32s31/register/soc/jpeg_reg.h
/** JPEG_STATUS5_REG register
 *  Trace and Debug registers
 */
#define JPEG_STATUS5_REG (DR_REG_JPEG_BASE + 0xa0)
/** JPEG_PIC_BLOCK_NUM : RO; bitpos: [23:0]; default: 0;
 *  Reserved
 */
#define JPEG_PIC_BLOCK_NUM    0x00FFFFFFU
#define JPEG_PIC_BLOCK_NUM_M  (JPEG_PIC_BLOCK_NUM_V << JPEG_PIC_BLOCK_NUM_S)
#define JPEG_PIC_BLOCK_NUM_V  0x00FFFFFFU
#define JPEG_PIC_BLOCK_NUM_S  0

/** JPEG_ECO_LOW_REG register
 *  Trace and Debug registers
 */
#define JPEG_ECO_LOW_REG (DR_REG_JPEG_BASE + 0xa4)
/** JPEG_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  redundant registers for jpeg
 */
#define JPEG_RDN_ECO_LOW    0xFFFFFFFFU
#define JPEG_RDN_ECO_LOW_M  (JPEG_RDN_ECO_LOW_V << JPEG_RDN_ECO_LOW_S)
#define JPEG_RDN_ECO_LOW_V  0xFFFFFFFFU
#define JPEG_RDN_ECO_LOW_S  0

/** JPEG_ECO_HIGH_REG register
 *  Trace and Debug registers
 */
#define JPEG_ECO_HIGH_REG (DR_REG_JPEG_BASE + 0xa8)
/** JPEG_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  redundant registers for jpeg
 */
#define JPEG_RDN_ECO_HIGH    0xFFFFFFFFU
#define JPEG_RDN_ECO_HIGH_M  (JPEG_RDN_ECO_HIGH_V << JPEG_RDN_ECO_HIGH_S)
#define JPEG_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define JPEG_RDN_ECO_HIGH_S  0

/** JPEG_CONFIG1_REG register
 *  Control and configuration registers
 */
#define JPEG_CONFIG1_REG (DR_REG_JPEG_BASE + 0xac)
/** JPEG_ENCODE_TIMEOUT_THRES : R/W; bitpos: [5:0]; default: 32;
 *  Configure the timeout period for encode can not output bitstream. The timeout
 *  periods =2 power (reg_encode_timeout_thres) -1
 */
#define JPEG_ENCODE_TIMEOUT_THRES    0x0000003FU
#define JPEG_ENCODE_TIMEOUT_THRES_M  (JPEG_ENCODE_TIMEOUT_THRES_V << JPEG_ENCODE_TIMEOUT_THRES_S)
#define JPEG_ENCODE_TIMEOUT_THRES_V  0x0000003FU
#define JPEG_ENCODE_TIMEOUT_THRES_S  0

/** JPEG_SYS_REG register
 *  Trace and Debug registers
 */
#define JPEG_SYS_REG (DR_REG_JPEG_BASE + 0xf8)
/** JPEG_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Reserved
 */
#define JPEG_CLK_EN    (BIT(31))
#define JPEG_CLK_EN_M  (JPEG_CLK_EN_V << JPEG_CLK_EN_S)
#define JPEG_CLK_EN_V  0x00000001U
#define JPEG_CLK_EN_S  31

/** JPEG_VERSION_REG register
 *  Trace and Debug registers
 */
#define JPEG_VERSION_REG (DR_REG_JPEG_BASE + 0xfc)
/** JPEG_JPEG_VER : R/W; bitpos: [27:0]; default: 38809904;
 *  Reserved
 */
#define JPEG_JPEG_VER    0x0FFFFFFFU
#define JPEG_JPEG_VER_M  (JPEG_JPEG_VER_V << JPEG_JPEG_VER_S)
#define JPEG_JPEG_VER_V  0x0FFFFFFFU
#define JPEG_JPEG_VER_S  0

#ifdef __cplusplus
}
#endif
